app/controllers/links_controller.rb

  def index
    @links = Link.all
---
SELECT "links".* FROM "links"

  def show
    @link = Link.find(params[:id])
    @link.update_attribute :views, @link.views+1
---
SELECT "links".* FROM "links" WHERE "links"."id" = 1 LIMIT 1
UPDATE "links" SET "views" = 1, "updated_at" = '2011-07-13 00:39:57.681454' WHERE "links"."id" = 3

  def create
    params[:link][:url] = "http://#{params[:link][:url]}" unless params[:link][:url].match(/^http(s?):\/\//)

    if Link.exists? :url => params[:link][:url]
      @link = Link.find_by_url params[:link][:url]
    else
      @link = Link.new  :url => params[:link][:url],
                        :shortcode => "#{Time.now.to_i}-#{rand(100000)}",
                        :views => 0
    end

    respond_to do |format|
      if @link.save
---
SELECT 1 FROM "links" WHERE ("links"."url" = 'http://www.google.com') AND ("links".id <> 3) LIMIT 1
INSERT INTO "links" ("url", "shortcode", "views", "created_at", "updated_at") VALUES ('http://www.google.com', NULL, NULL, '2011-07-12 23:07:40.341711', '2011-07-12 23:07:40.341711')